import React from "react";

function Agreement() {
  return (
    <section className="h-40 w-full overflow-auto font-Anuphan">
      <h1 className="text-2xl font-semibold">ข้อตกลงการใช้งาน</h1>
      <section className="mt-5">
        <h2 className="text-lg font-semibold">การยอมรับข้อตกลง: </h2>
        <span>
          {" "}
          ด้วยการสมัครใช้งานระบบ Korat KOS
          ผู้ใช้งานยินยอมที่จะผูกพันตามเงื่อนไขและข้อตกลงที่ระบุไว้ในเอกสารนี้
          และยินยอมให้ระบบใช้ข้อมูลส่วนบุคคลตามที่ระบุไว้ด้านล่างนี้
        </span>
      </section>
      <section className="mt-5">
        <h2 className="text-lg font-semibold">การใช้ข้อมูลส่วนบุคคล: </h2>
        <span>
          {" "}
          ผู้ใช้งานยินยอมให้ระบบ Korat KOS ใช้ข้อมูลส่วนบุคคล เช่น เบอร์โทร,
          เลขบัตรประชาชน, และข้อมูลอื่นๆ ที่เกี่ยวข้อง
          เพื่อวัตถุประสงค์ในการสมัครขอรับการตรวจประเมินมาตรฐานเกษตรอินทรีย์ขั้นพื้นฐาน
        </span>
      </section>
      <section className="mt-5">
        <h2 className="text-lg font-semibold">การเปิดเผยข้อมูล: </h2>
        <span>
          {" "}
          ผู้ใช้งานยินยอมให้ระบบ Korat KOS
          เปิดเผยข้อมูลส่วนบุคคลต่อหน่วยงานที่เกี่ยวข้องภายในกระบวนการตรวจประเมินและการรับรองมาตรฐานเกษตรอินทรีย์
        </span>
      </section>
      <section className="mt-5">
        <h2 className="text-lg font-semibold">การรักษาความปลอดภัยข้อมูล: </h2>
        <span>
          {" "}
          Korat KOS
          มีความมุ่งมั่นที่จะรักษาความปลอดภัยของข้อมูลส่วนบุคคลและจะดำเนินการตามมาตรฐานความปลอดภัยข้อมูลที่เหมาะสมเพื่อป้องกันการสูญหาย,
          การเข้าถึง, การเปิดเผย,
          การเปลี่ยนแปลงหรือการทำลายข้อมูลอย่างไม่ชอบด้วยกฎหมาย
        </span>
      </section>
      <section className="mt-5">
        <h2 className="text-lg font-semibold">การเปลี่ยนแปลงข้อตกลง: </h2>
        <span>
          {" "}
          Korat KOS
          สงวนสิทธิ์ในการเปลี่ยนแปลงหรือปรับปรุงข้อตกลงนี้ได้ทุกเมื่อโดยไม่ต้องแจ้งให้ผู้ใช้งานทราบล่วงหน้า
          การใช้งานระบบต่อไปหลังจากการเปลี่ยนแปลงข้อตกลงจะถือว่าเป็นการยอมรับข้อตกลงใหม่
        </span>
      </section>
      <section className="mt-5">
        <span>
          {" "}
          ข้อตกลงนี้เป็นการยินยอมจากผู้ใช้งานที่ชัดเจนและตระหนักถึงการใช้งานข้อมูลส่วนบุคคลและการเปิดเผยข้อมูลในกรอบที่ได้กำหนดไว้
          โดยมีเป้าหมายเพื่อสนับสนุนกระบวนการตรวจประเมินและการรับรองมาตรฐานเกษตรอินทรีย์อย่างมีประสิทธิภาพและโปร่งใสในจังหวัดนครราชสีมา.
        </span>
      </section>
    </section>
  );
}

export default Agreement;
